-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 19, 2024 at 06:11 AM
-- Server version: 8.0.17
-- PHP Version: 7.3.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `logs_it_network`
--

-- --------------------------------------------------------

--
-- Table structure for table `mains`
--

CREATE TABLE `mains` (
  `LOGS_ID` int(11) NOT NULL,
  `LOGS_DATE` varchar(255) DEFAULT NULL,
  `LOGS_CASE_NUMBER` text,
  `LOGS_CASE_CONTACT` varchar(255) NOT NULL,
  `LOGS_LOCATION` varchar(128) DEFAULT NULL,
  `LOGS_RANGE_TIME` varchar(255) DEFAULT NULL,
  `LOGS_PHONE` varchar(255) NOT NULL,
  `LOGS_TECHNICIANS` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf32;

--
-- Dumping data for table `mains`
--

INSERT INTO `mains` (`LOGS_ID`, `LOGS_DATE`, `LOGS_CASE_NUMBER`, `LOGS_CASE_CONTACT`, `LOGS_LOCATION`, `LOGS_RANGE_TIME`, `LOGS_PHONE`, `LOGS_TECHNICIANS`) VALUES
(112, '01/16/2024', 'INC000002164006', 'Centercom', 'พรเจริญ,บึงกาฬ', '1', '0951798791', 'นายเอกชัย สิมมาหลวง'),
(113, '01/16/2024', 'PRM6701450', 'Tuwanon Kirathan', '634PrabHo, Prajak, Nai Mueang, Mueang Nong Khai 43000', '1', '0883514069', 'นายเอกชัย สิมมาหลวง'),
(114, '01/10/2024', '2016412602', 'ศราวุธ', '120/3 Soi 3 Jamnusorn rd, makkheng Mueang UdonThani 41000', '1', '0818602876', 'นายเอกชัย สิมมาหลวง'),
(115, '01/12/2024', 'WO:4011153095', 'Tuwanon Kirathan', 'PrabHo, Prajak Road, Nai Mueang, Mueang Nong Khai 43000', '1', '0883514069', 'นายเอกชัย สิมมาหลวง'),
(116, '01/16/2024', 'INC00000214633', 'เอก', 'บิ๊กซี อุดรธานี 1', '1', '0909485158', 'นายเอกชัย สิมมาหลวง'),
(117, '01/04/2024', 'INC000002140154', 'Synergize callcenter', 'นาหว้า,นครพนม', '1', '0939952328', 'นายเอกชัย สิมมาหลวง'),
(118, '01/02/2024', 'WO:4010993913', 'ปรมัตถ์ สุทธิแสน', '225/15 ม.6 ชุมชนบ้านเดื่อ หมู่บ้านอรพิน ต.หมากแข้ง อ.เมือง จ.อุดรธานี 41150', '1', '0658384461', 'นายเอกชัย สิมมาหลวง'),
(119, '01/02/2024', 'INC000002137690', 'Synergize Callcenter', 'ตลาดชัยพร, หนองคาย', '1', '0639952328', 'นายธนพล โมรา'),
(120, '11/29/2023', 'PRM6612871', 'Peeranuch', '121/11 Sricomcheun RD. T.Markkeng A.Mueng Udon Thani 41000', '1', '0635351593', 'นายเอกชัย สิมมาหลวง'),
(121, '11/29/2023', 'INC000001683021', 'Synergize Callcenter', 'ขอนแก่น', '1', '0895758107', 'นายจิระศักดิ์ อยู่ยงค์'),
(122, '12/28/2023', '83902A', 'คุณปิติพงษ์ สกุลเดช ', 'ศป.อุดรธานี สำนักงานไปรษณีย์เขต 4/ปข.4 39 หมู่ 12 ถนนมิตรภาพ ตำบลโนนสูง อำเภอเมือง จังหวัดอุดรธานี 41000', '1', '0892749283', 'ไม่พบรายชื่อช่าง'),
(123, '12/28/2023', 'INC000002129374', 'Express#2737', 'โลตัสเอ็กเพลส สาขา สะพานมิตรภาพไทยลาว, หนองคาย', '1', '0626058835', 'นายจิระศักดิ์ อยู่ยงค์'),
(124, '12/26/2023', 'INC000002125212', 'Talad#6486', 'นาแก, นครพนม', '1', '042527047', 'นายจิระศักดิ์ อยู่ยงค์'),
(125, '11/28/2023', 'PRM6611988', 'ณัฐพันธุ์', ' OBT IT คอมพิวเตอร์หนองคาย', '1', '0610292735', 'นายธนพัฒน์'),
(126, '11/24/2024', '74870A', 'จิราวุฒิ ตันนารัตน์', 'สำนักงานไปรษณีย์เขต 4/ปข.4 110 หมู่ 2 ตำบลกอมเกาะ อ.เมือง จ.หนองคาย หนองคาย  43000', '1', '0917719162', 'ไม่พบรายชื่อช่าง'),
(127, '11/24/2024', '74862A', 'จิราวุฒิ ตันนารัตน์', 'สำนักงานไปรษณีย์เขต 4/ปข.4 110 หมู่ 2 ตำบลกอมเกาะ อ.เมือง จ.หนองคาย หนองคาย  43000', '1', '0917719162', 'ไม่พบรายชื่อช่าง'),
(128, '11/22/2024', 'INC000002064107', 'Talad#6486', 'นาแก, นครพนม', '1', '042527047', 'ไม่พบรายชื่อช่าง'),
(129, '11/20/2024', 'INC000002061414', 'Talad#6479', 'บ้านดุง, จังหวัดอุดรธานี', '1', '0632176193', 'ไม่พบรายชื่อช่าง'),
(130, '11/13/2024', 'WO:4010357721', 'Advice Nongkhai', '1220/3 M2 T.Naimueng Mueng Nong Khai 43000', '1', '0612650447', 'ไม่พบรายชื่อช่าง'),
(133, '12/27/2023', '22122566-6', 'สตง.อุดรธานี', 'สตง.ที่6อุดรธานี', '1', '0874740004', 'นายเอกชัย สิมมาหลวง'),
(134, '01/18/2024', 'WO:4010956332', 'Kunakorn', 'Tawandaeng(Udon Thani)', '1', '0843561169', 'นายเอกชัย สิมมาหลวง'),
(135, '12/28/2023', 'Centercom:1674', 'คุณหมู', 'Makro store Udon Thani', '1', '0931780237', 'นายเอกชัย สิมมาหลวง'),
(136, '12/28/2023', 'WO:4010951675', 'กรุงเทพอุดร', 'โรงพยาบาลกรุงเทพอุดรธานี(แผนกITชั้น4)', '1', '0953709045', 'นายเอกชัย สิมมาหลวง'),
(137, '01/18/2024', 'INC000002117217', 'เบอร์สาขา', 'โลตัสสะพานมิตรภาพไทยลาวหนองคาย', '1', '0626058835', 'นายเอกชัย สิมมาหลวง'),
(138, '12/19/2023', 'INC000002113674', 'สาขา', 'นาแก,นครพนม', '1', '042527047', 'นายเอกชัย สิมมาหลวง'),
(139, '12/15/2023', '80754A', 'คุณนิติวัติ พฤฒิสาร', 'สำนักงานไปรษณีย์เขต 4 ทุ่งฝน', '1', '09177220199', 'นายธนพัฒน์'),
(142, '12/16/2023', 'INC000002107976', 'โลตัสบ้านปะโค จ.หนองคาย', 'โลตัสบ้านปะโค จ.หนองคาย', '1', '0960011338', 'นายเอกชัย สิมมาหลวง'),
(143, '12/14/2023', 'SR-202309-0091LND', 'คุณเอก', 'โลตัสนาดี', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(144, '12/14/2023', 'SR-202309-0074NBL', 'เอก', 'โลตัส หนองบัวลำภู', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(145, '01/18/2024', 'SR-202311-0016BUD', 'เอก', 'บิ๊กซี อุดรธานี 1', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(146, '12/13/2023', 'INC000002103988', 'สาขา', 'ด่านซ้าย,ร้อยเอ็ด', '1', '0632176193', 'นายเอกชัย สิมมาหลวง'),
(147, '12/09/2023', 'SR-202312-0009-1LND', 'เอก', 'โลตัสนาดี', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(148, '12/06/2023', 'IM378840', 'ปรีชาญ บุญมาศ', 'หนองคาย อ.เมือง', '1', '0429900808', 'นายเอกชัย สิมมาหลวง'),
(149, '12/05/2023', 'SR-202312-0009', 'เอก', 'โลตัส นาดี', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(150, '12/02/2023', 'WO:4010620305', 'คุญฐิฆัมพล', 'กสิกรไทย สาขาอุดรธานี', '1', '0915451017', 'นายเอกชัย สิมมาหลวง'),
(151, '12/01/2023', 'INC000002075523', 'สาขา', 'โลตัส โคกศรีสุพรรณ,สกลนคร', '1', '0659290291', 'นายเอกชัย สิมมาหลวง'),
(152, '11/30/2023', 'WO:4010561867', 'ณัฐพันธุ์', 'OBT IT คอมพิวเตอร์ หนองคาย', '1', '0610292735', 'นายเอกชัย สิมมาหลวง'),
(153, '11/29/2023', 'IT-SR-202310-0006', 'เอก', 'Major อุดรธานี', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(154, '11/27/2023', 'IT-SR-202309-0114 NBL', 'เอก', 'โลตัส หนองบัวลำภู', '1', '0909485181', 'นายเอกชัย สิมมาหลวง'),
(155, '11/25/2023', '74870A', 'จิราวุฒิ ตันนารัตน์', 'ไปรษณีย์เขต 4/ปข.4 หนองคายDB1', '1', '0917719162', 'นายเอกชัย สิมมาหลวง'),
(156, '11/24/2023', '74862A', 'จิราวถฒิ ตันนารัตน์', 'ไปรษณีน์เขต 4/ปข,4 หนองคาย', '1', '0846856669', 'นายเอกชัย สิมมาหลวง'),
(157, '11/22/2023', 'INC000002064107', 'นาแก นครพนม', 'นาแก,นครพนม', '1', '042527047', 'นายเอกชัย สิมมาหลวง'),
(158, '11/09/2023', 'INC000002037939', 'ศรีวิไล บึงกาฬ', 'ศรีวิไล,บึงกาฬ', '1', '0626040886', 'นายเอกชัย สิมมาหลวง'),
(159, '11/08/2023', '69766A', 'ธีธัช เจริญยิ่งยศ', 'ไปรษณีย์ 4/ปข.4', '1', '0917719162', 'นายเอกชัย สิมมาหลวง'),
(160, '11/06/2023', 'INC000002032642', 'คำตากล้า', 'คำตากล้า', '1', '0970377731', 'นายเอกชัย สิมมาหลวง');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `USR_ID` int(11) NOT NULL,
  `USR_NAME` varchar(255) DEFAULT NULL,
  `USR_PWD` varchar(255) DEFAULT NULL,
  `USR_ROLE` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf32;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`USR_ID`, `USR_NAME`, `USR_PWD`, `USR_ROLE`) VALUES
(1, 'admin', 'c93ccd78b2076528346216b3b2f701e6', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `mains`
--
ALTER TABLE `mains`
  ADD PRIMARY KEY (`LOGS_ID`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`USR_ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `mains`
--
ALTER TABLE `mains`
  MODIFY `LOGS_ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=161;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `USR_ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
